config.org
#+title: Doom configuration
#+author: Pierie Wang
#+html_head: <link rel='shortcut icon' type='image/png' href='https://www.gnu.org/software/emacs/favicon.png'>
#+HTML_HEAD: <link rel="stylesheet" href="https://vanillacss.com/vanilla.css">
#+property: header-args:emacs-lisp :tangle yes :comments link
#+property: header-args:elisp :exports code
#+property: header-args:shell :tangle "setup.sh"
#+property: header-args :tangle no :results silent :eval no-export
#+BABEL: :cache yes
#+PROPERTY: header-args :tangle yes :results silent
#+STARTUP: content indent
#+SEQ_TODO: TODO(t) | DISABLED(D)
* Package Configurations

* Installing
:PROPERTIES:
:header-args:emacs-lisp: :tangle no :comments no
:END:
This config works best with [[https://github.com/d12frosted/homebrew-emacs-plus][emacs-plus]] (27.1)
#+begin_src sh :tangle no
  brew tap d12frosted/emacs-plus
  brew install emacs-plus
  ln -s /usr/local/opt/emacs-plus/Emacs.app /Applications/Emacs.app
#+end_src

** Dependencies
#+begin_src sh :tangle no
  brew install ispell
  brew cask install mactex
#+end_src

** Meta
When this configuration is loaded for the first time, the =init.el= is the file that is loaded. It looks like this:

#+BEGIN_SRC emacs-lisp :tangle no
  ;; This file replaces itself with the actual configuration at first run.

  ;; We can't tangle without org!
  (require 'org)
  ;; Open the configuration
  (find-file (concat user-emacs-directory "init.org"))
  ;; tangle it
  (org-babel-tangle)
  ;; load it
  (load-file (concat user-emacs-directory "init.el"))
  ;; finally byte-compile it
  (byte-compile-file (concat user-emacs-directory "init.el"))
#+END_SRC

** Headers
Lexical scoping for the init-file is needed, it can be specified in the header. This is the first line of the actual configuration:

#+BEGIN_SRC emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+END_SRC

Tangle and compile this file on save automatically:

This helps get rid of =functions might not be defined at runtime= warnings. See https://github.com/jwiegley/use-package!/issues/590

#+BEGIN_SRC emacs-lisp :tangle no
  (eval-when-compile
    (defvar use-package!-expand-minimally byte-compile-current-file))
#+END_SRC

* Configurations
:PROPERTIES:
:header-args:emacs-lisp: :tangle yes :comments yes
:END:

All configurations here get "tangled" into the main ~config.el~ file.

** Better defaults
*** Simple Settings

#+begin_src emacs-lisp
(setq-default
 delete-by-moving-to-trash t                      ; Delete files to trash
 window-combination-resize t                      ; take new window space from all other windows (not just current)
 x-stretch-cursor t)                              ; Stretch cursor to the glyph width

(setq undo-limit 80000000                         ; Raise undo-limit to 80Mb
      evil-want-fine-undo t                       ; By default while in insert all changes are one big blob. Be more granular
      auto-save-default t                         ; Nobody likes to loose work, I certainly don't
      truncate-string-ellipsis "…"                ; Unicode ellispis are nicer than "...", and also save /precious/ space
      password-cache-expiry nil                   ; I can trust my computers ... can't I?
      scroll-preserve-screen-position nil     ; Don't have `point' jump around
      scroll-margin 2)                            ; It's nice to maintain a little margin

(display-time-mode 1)                             ; Enable time in the mode-line

(unless (string-match-p "^Power N/A" (battery))   ; On laptops...
  (display-battery-mode 1))                       ; it's nice to know how much power you have

(global-subword-mode 1)                           ; Iterate through CamelCase words
#+end_src

*** Auto-customisations
By default changes made via a customisation interface are added to =init.el=.
I prefer the idea of using a separate file for this. We just need to change a
setting, and load it if it exists.
#+begin_src emacs-lisp
(setq-default custom-file (expand-file-name ".custom.el" doom-private-dir))
(when (file-exists-p custom-file)
  (load custom-file))
#+end_src

*** Windows
I find it rather handy to be asked which buffer I want to see after splitting
the window. Let's make that happen.

First, we'll enter the new window
#+begin_src emacs-lisp
(setq evil-vsplit-window-right t
      evil-split-window-below t)
#+end_src

Then, we'll pull up ~ivy~
#+begin_src emacs-lisp
(defadvice! prompt-for-buffer (&rest _)
  :after '(evil-window-split evil-window-vsplit)
  (+ivy/switch-buffer))
#+end_src

Oh, and previews are nice
#+begin_src emacs-lisp
(setq +ivy-buffer-preview t)
#+end_src

Window rotation is nice, and can be found under =SPC w r= and =SPC w R=.
/Layout/ rotation is also nice though. Let's stash this under =SPC w SPC=, inspired
by Tmux's use of =C-b SPC= to rotate windows.

We could also do with adding the missing arrow-key variants of the window
navigation/swapping commands.
#+begin_src emacs-lisp
(map! :map evil-window-map
      "SPC" #'rotate-layout
      ;; Navigation
      "<left>"     #'evil-window-left
      "<down>"     #'evil-window-down
      "<up>"       #'evil-window-up
      "<right>"    #'evil-window-right
      ;; Swapping windows
      "C-<left>"       #'+evil/window-move-left
      "C-<down>"       #'+evil/window-move-down
      "C-<up>"         #'+evil/window-move-up
      "C-<right>"      #'+evil/window-move-right)
#+end_src
** Allow Local Variables

#+begin_src emacs-lisp
(setq-default enable-local-variables t)
#+end_src
** Bookmarks
#+begin_src emacs-lisp
  (global-set-key (kbd "C-x r D") 'bookmark-delete)
#+end_src

** Tramp
#+begin_src emacs-lisp
;; Tramp setup

(setq tramp-default-method "ssh")
#+end_src

** =tab-bar-mode=

#+begin_src emacs-lisp
  ;; (tab-bar-mode 1)
  (setq tab-bar-show nil)
#+end_src

*** Tab Switching Keybinds                                       :keybinds:
#+begin_src emacs-lisp
  (global-set-key (kbd "s-{") (lambda () (interactive) (tab-next -1)))
  (global-set-key (kbd "s-}") (lambda () (interactive) (tab-next 1)))
#+end_src

** Custom Functions
*** append-to-list
#+begin_src emacs-lisp
  (defun append-to-list (list-var elements)
    "Append ELEMENTS to the end of LIST-VAR.

  The return value is the new value of LIST-VAR."
    (unless (consp elements)
      (error "ELEMENTS must be a list"))
    (let ((list (symbol-value list-var)))
      (if list
          (setcdr (last list) elements)
        (set list-var elements)))
    (symbol-value list-var))
#+end_src

*** Increment/Decrement Numbers
#+begin_src emacs-lisp
  ;;; Increment Numbers
  (defun increment-number-at-point ()
    "Increments numbers at cursor"
    (interactive)
    (skip-chars-backward "0-9")
    (or (looking-at "[0-9]+")
        (error "No number at point"))
    (replace-match (number-to-string (1+ (string-to-number (match-string 0))))))

  ;;; Decrement Numbers
  (defun decrement-number-at-point ()
    "Decrements numbers at cursor"
    (interactive)
    (skip-chars-backward "0-9")
    (or (looking-at "[0-9]+")
        (error "No number at point"))
    (replace-match (number-to-string (1- (string-to-number (match-string 0))))))

  ;;; Binding
  (global-set-key (kbd "C-; C-=") 'increment-number-at-point)
  (global-set-key (kbd "C-; C--") 'decrement-number-at-point)
#+end_src

*** Insert Directory (obsolete?)
#+begin_src emacs-lisp
  (defun insertdirectory ()
    "Insert current directory for macro use"
    (interactive)
    (insert default-directory))
#+end_src

*** Insert Org-mode Image
#+begin_src emacs-lisp
  (defun insert-org-image (&optional swindow)
    "Prompt user for name of file, append time and date string, then use the Mac OSX `screencapture` feature to take a photo and place it in the relative ./figures directory."
    (interactive "P")
    (unless (not (memq system-type '(gnu gnu/linux darwin)))
           (let* ((outdir "figures")
                  (givenname (read-string "Enter File Name: "))
                  (namefile (concat (format-time-string "%Y%m%d_%H%M%S") (if (not (string= givenname "")) (concat "_" givenname) "") ".jpeg"))
                  (program (cond ((if (memq system-type '(gnu gnu/linux)) "gnome-screenshot" nil))
                                 ((if (eq system-type 'darwin) "screencapture" ""))))
                  (argument (cond ((string= program "screencapture") (if swindow "-w" "-i"))
                                  ((string= program "gnome-screenshot") (if swindow "-w" "-a"))))
                  (outfile (concat outdir "/" namefile)))
             (unless (file-directory-p outdir)
               (make-directory outdir t))
             (if (memq system-type '(gnu gnu/linux))
                 (setq outfile (concat "--file=" outfile)))
             (message "Program: %s\nArgument: %s\nOutfile: %s" program argument outfile)
             (call-process program nil nil nil argument outfile)
             (message namefile)
             (insert (concat (concat "[[file:./figures/" (file-name-nondirectory outfile)) "]]")))))
#+end_src

*** Keyboard Coding System
#+begin_src emacs-lisp
  (set-keyboard-coding-system nil)
#+end_src

