config.el
;; [[file:config.org::*Simple Settings][Simple Settings:1]]
(setq-default
 delete-by-moving-to-trash t                      ; Delete files to trash
 window-combination-resize t                      ; take new window space from all other windows (not just current)
 x-stretch-cursor t)                              ; Stretch cursor to the glyph width

(setq undo-limit 80000000                         ; Raise undo-limit to 80Mb
      evil-want-fine-undo t                       ; By default while in insert all changes are one big blob. Be more granular
      auto-save-default t                         ; Nobody likes to loose work, I certainly don't
      truncate-string-ellipsis "…"                ; Unicode ellispis are nicer than "...", and also save /precious/ space
      password-cache-expiry nil                   ; I can trust my computers ... can't I?
      scroll-preserve-screen-position nil     ; Don't have `point' jump around
      scroll-margin 2)                            ; It's nice to maintain a little margin

(display-time-mode 1)                             ; Enable time in the mode-line

(unless (string-match-p "^Power N/A" (battery))   ; On laptops...
  (display-battery-mode 1))                       ; it's nice to know how much power you have

(global-subword-mode 1)                           ; Iterate through CamelCase words
;; Simple Settings:1 ends here

;; [[file:config.org::*Auto-customisations][Auto-customisations:1]]
(setq-default custom-file (expand-file-name ".custom.el" doom-private-dir))
(when (file-exists-p custom-file)
  (load custom-file))
;; Auto-customisations:1 ends here

;; [[file:config.org::*Windows][Windows:1]]
(setq evil-vsplit-window-right t
      evil-split-window-below t)
;; Windows:1 ends here

;; [[file:config.org::*Windows][Windows:2]]
(defadvice! prompt-for-buffer (&rest _)
  :after '(evil-window-split evil-window-vsplit)
  (+ivy/switch-buffer))
;; Windows:2 ends here

;; [[file:config.org::*Windows][Windows:3]]
(setq +ivy-buffer-preview t)
;; Windows:3 ends here

;; [[file:config.org::*Windows][Windows:4]]
(map! :map evil-window-map
      "SPC" #'rotate-layout
      ;; Navigation
      "<left>"     #'evil-window-left
      "<down>"     #'evil-window-down
      "<up>"       #'evil-window-up
      "<right>"    #'evil-window-right
      ;; Swapping windows
      "C-<left>"       #'+evil/window-move-left
      "C-<down>"       #'+evil/window-move-down
      "C-<up>"         #'+evil/window-move-up
      "C-<right>"      #'+evil/window-move-right)
;; Windows:4 ends here

;; [[file:config.org::*Allow Local Variables][Allow Local Variables:1]]
(setq-default enable-local-variables t)
;; Allow Local Variables:1 ends here

;; [[file:config.org::*Bookmarks][Bookmarks:1]]
  (global-set-key (kbd "C-x r D") 'bookmark-delete)
;; Bookmarks:1 ends here

;; [[file:config.org::*=tab-bar-mode=][=tab-bar-mode=:1]]
  ;; (tab-bar-mode 1)
  (setq tab-bar-show nil)
;; =tab-bar-mode=:1 ends here

;; [[file:config.org::*Tab Switching Keybinds][Tab Switching Keybinds:1]]
  (global-set-key (kbd "s-{") (lambda () (interactive) (tab-next -1)))
  (global-set-key (kbd "s-}") (lambda () (interactive) (tab-next 1)))
;; Tab Switching Keybinds:1 ends here

;; [[file:config.org::*append-to-list][append-to-list:1]]
  (defun append-to-list (list-var elements)
    "Append ELEMENTS to the end of LIST-VAR.

  The return value is the new value of LIST-VAR."
    (unless (consp elements)
      (error "ELEMENTS must be a list"))
    (let ((list (symbol-value list-var)))
      (if list
          (setcdr (last list) elements)
        (set list-var elements)))
    (symbol-value list-var))
;; append-to-list:1 ends here

;; [[file:config.org::*Increment/Decrement Numbers][Increment/Decrement Numbers:1]]
  ;;; Increment Numbers
  (defun increment-number-at-point ()
    "Increments numbers at cursor"
    (interactive)
    (skip-chars-backward "0-9")
    (or (looking-at "[0-9]+")
        (error "No number at point"))
    (replace-match (number-to-string (1+ (string-to-number (match-string 0))))))

  ;;; Decrement Numbers
  (defun decrement-number-at-point ()
    "Decrements numbers at cursor"
    (interactive)
    (skip-chars-backward "0-9")
    (or (looking-at "[0-9]+")
        (error "No number at point"))
    (replace-match (number-to-string (1- (string-to-number (match-string 0))))))

  ;;; Binding
  (global-set-key (kbd "C-; C-=") 'increment-number-at-point)
  (global-set-key (kbd "C-; C--") 'decrement-number-at-point)
;; Increment/Decrement Numbers:1 ends here

;; [[file:config.org::*Insert Directory (obsolete?)][Insert Directory (obsolete?):1]]
  (defun insertdirectory ()
    "Insert current directory for macro use"
    (interactive)
    (insert default-directory))
;; Insert Directory (obsolete?):1 ends here

;; [[file:config.org::*Insert Org-mode Image][Insert Org-mode Image:1]]
  (defun insert-org-image (&optional swindow)
    "Prompt user for name of file, append time and date string, then use the Mac OSX `screencapture` feature to take a photo and place it in the relative ./figures directory."
    (interactive "P")
    (unless (not (memq system-type '(gnu gnu/linux darwin)))
           (let* ((outdir "figures")
                  (givenname (read-string "Enter File Name: "))
                  (namefile (concat (format-time-string "%Y%m%d_%H%M%S") (if (not (string= givenname "")) (concat "_" givenname) "") ".jpeg"))
                  (program (cond ((if (memq system-type '(gnu gnu/linux)) "gnome-screenshot" nil))
                                 ((if (eq system-type 'darwin) "screencapture" ""))))
                  (argument (cond ((string= program "screencapture") (if swindow "-w" "-i"))
                                  ((string= program "gnome-screenshot") (if swindow "-w" "-a"))))
                  (outfile (concat outdir "/" namefile)))
             (unless (file-directory-p outdir)
               (make-directory outdir t))
             (if (memq system-type '(gnu gnu/linux))
                 (setq outfile (concat "--file=" outfile)))
             (message "Program: %s\nArgument: %s\nOutfile: %s" program argument outfile)
             (call-process program nil nil nil argument outfile)
             (message namefile)
             (insert (concat (concat "[[file:./figures/" (file-name-nondirectory outfile)) "]]")))))
;; Insert Org-mode Image:1 ends here

;; [[file:config.org::*Keyboard Coding System][Keyboard Coding System:1]]
  (set-keyboard-coding-system nil)
;; Keyboard Coding System:1 ends here
