config.el

;; [[file:config.org::*Dired Open File][Dired Open File:1]]
  (defun pgw/dired-open-file ()
    "In dired, open the file named on this line using the default application in the system."
    (interactive)
    (let ((file (dired-get-filename nil t)) ; Full path
          (filename (dired-get-filename t t))) ; File name for display
      (message "Opening %s..." filename)
      (cond ((memq window-system '(mac ns))
             (call-process "open" nil 0 nil file))
            ((memq window-system '(x))
             (call-process "xdg-open" nil 0 nil file)))
      (message "Opening %s done" filename)))
;; Dired Open File:1 ends here

;; [[file:config.org::*Copy MLA org-file][Copy MLA org-file:1]]
  (defun pgw/copy-mla-file ()
    "Copy MLA_OrgFile.org to current directory for use in school essays."
    (interactive)
    (copy-file "~/Dropbox/org/templates/school/MLA_OrgFile.org" default-directory)
    )
;; Copy MLA org-file:1 ends here

;; [[file:config.org::*Lookup in Dictionary (Apple)][Lookup in Dictionary (Apple):1]]
  (when (eq system-type 'darwin)
    (defun pgw/lookup-dictionary ()
      "Function to open a dictionary searching the highlighted word
  No spaces are allowed in the input of this function"
      (interactive)
      (let ((word (read-from-minibuffer "Word query: ")))
        (call-process "open" nil nil nil (concat "dict://" word)))
      )
    (global-set-key (kbd "M-#") 'pgw/lookup-dictionary)
    )
;; Lookup in Dictionary (Apple):1 ends here

;; [[file:config.org::*Test network (internet-up-p)][Test network (internet-up-p):1]]
  (defun internet-up-p (&optional host)
    (= 0 (call-process "ping" nil nil nil "-c" "1" "-W" "1"
                       (if host host "1.1.1.1"))))
;; Test network (internet-up-p):1 ends here

;; [[file:config.org::*Get org link][Get org link:1]]
  (defun pgw/org-get-link-at-point ()
    "Get the link from an org heading"
    (interactive)
    (let* ((context (org-element-context))
           (link (if (eq (car context) 'link)
                     (org-element-property :path context)
                   nil)))
      (if link (kill-new (concat (org-element-property :type context) ":" link)))))

  (global-set-key (kbd "C-c s-l") 'pgw/org-get-link-at-point)
;; Get org link:1 ends here

;; [[file:config.org::*Make-shell][Make-shell:1]]
  (defun make-shell (name)
    "Create a shell buffer named NAME."
    (interactive "sName: ")
    (setq name (concat "$" name))
    (eshell 4)
    (rename-buffer name))
;; Make-shell:1 ends here

;; [[file:config.org::*Concat with new lines][Concat with new lines:1]]
(defun concatnl (&rest SEQS)
  "Concatenate strings with new lines"
  (let ((return ""))
    (dolist (element SEQS return)
      (setq return (concat return "\n" element)))
    (substring return 1 nil)))
;; Concat with new lines:1 ends here

;; [[file:config.org::*Modifier Keys][Modifier Keys:1]]
  (when (eq system-type 'darwin)
    (with-no-warnings
      (setq mac-option-modifier 'meta)
      (setq mac-control-modifier 'control)
      (setq ns-function-modifier 'hyper)))

  (when (eq system-type 'gnu/linux)
    (with-no-warnings (setq x-super-keysym 'hyper)))
;; Modifier Keys:1 ends here

;; [[file:config.org::*Visuals][Visuals:1]]
  ;(load-theme 'tango-dark t)
  ;; (load-theme 'monokai)
  ;; ;
  ;; Frame
  (add-to-list 'default-frame-alist '(height . 46))
  (add-to-list 'default-frame-alist '(width . 146))

  ;;; Visual line mode (for text wrapping)
  (global-set-key (kbd "C-x v v") 'visual-line-mode)

  ;; Darkroom-tentative-mode
  (global-set-key (kbd "C-x v d") 'darkroom-tentative-mode)

  ;; (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
  (add-to-list 'default-frame-alist '(ns-appearance . dark)) ;; assuming you are using a dark theme
  ;; (setq ns-use-proxy-icon nil)
  ;; (setq frame-title-format nil)
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)

  (setq visual-line-fringe-indicators '(left-curly-arrow hollow-square)) ;; '(left-curly-arrow right-curly-arrow) for both left and right
  ;; Testing freetonik's fringe indicator alist
  (setq-default fringe-indicator-alist '((truncation left-arrow right-arrow)
   (continuation nil right-arrow)
   (overlay-arrow . right-triangle)
   (up . up-arrow)
   (down . down-arrow)
   (top top-left-angle top-right-angle)
   (bottom bottom-left-angle bottom-right-angle top-right-angle top-left-angle)
   (top-bottom left-bracket right-bracket top-right-angle top-left-angle)
   (empty-line . empty-line)
   (unknown . question-mark)))
;; Visuals:1 ends here

;; [[file:config.org::*All the Icons][All the Icons:1]]
  (use-package! all-the-icons)
;; All the Icons:1 ends here

;; [[file:config.org::*Doom Theme][Doom Theme:1]]
  (use-package! doom-themes
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled

    ;; Load the theme (doom-one, doom-molokai, etc); keep in mind that each theme
    ;; may have their own settings.
    (load-theme 'doom-snazzy t)
    ;; (load-theme 'modus-operandi)

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)

    ;; Enable custom neotree theme (all-the-icons must be installed!)
    ;; (doom-themes-neotree-config)
    ;; or for treemacs users
    (setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
    (doom-themes-treemacs-config)

    ;; Doom themes fontifies #hashtags and @at-tags by default.
    ;; To disable this:
    (setq doom-org-special-tags nil)

    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config)
    )
;; Doom Theme:1 ends here

;; [[file:config.org::*Frame Resize Pixelwise][Frame Resize Pixelwise:1]]
  (setq frame-resize-pixelwise t)
;; Frame Resize Pixelwise:1 ends here

;; [[file:config.org::*Line Numbers][Line Numbers:1]]
  ;; (global-visual-line-mode t)
  (setq display-line-numbers-type 'visual)
  ;; (setq-default display-line-numbers 'visual)
  (set-default 'truncate-lines t)
;; Line Numbers:1 ends here

;; [[file:config.org::*Window Management][Window Management:1]]
  (use-package! rotate)
;; Window Management:1 ends here

;; [[file:config.org::*Treemacs][Treemacs:1]]
  (use-package! treemacs)
  (use-package! treemacs-evil)
  (use-package! treemacs-magit)
;; Treemacs:1 ends here

;; [[file:config.org::*ztree (Tool for diffing and merging directories)][ztree (Tool for diffing and merging directories):1]]
  (use-package! ztree)
;; ztree (Tool for diffing and merging directories):1 ends here
