config.el

;; [[file:config.org::*Doom fonts][Doom fonts:1]]
(setq doom-font (font-spec :family "Ubuntu Mono" :size 14 :height 1.0)
      doom-big-font (font-spec :family "Ubuntu Mono" :size 26)
      doom-variable-pitch-font (font-spec :family "Open Sans" :size 12)
      doom-unicode-font (font-spec :family "Ubuntu Mono")
      doom-serif-font (font-spec :family "Ubuntu"))
;; Doom fonts:1 ends here

;; [[file:config.org::*Mixed Pitch][Mixed Pitch:1]]
  (use-package! mixed-pitch
    :config
    ;; (set-face-attribute 'variable-pitch :height 160)
    (dolist (face '(line-number line-number-current-line org-list-dt org-link)) (add-to-list 'mixed-pitch-fixed-pitch-faces face))
    ;; (add-hook! 'text-mode-hook 'mixed-pitch-mode)
    (map! :leader
          :n "t m" 'mixed-pitch-mode)
    (set-face-attribute 'variable-pitch nil :height 0.8))
;; Mixed Pitch:1 ends here

;; [[file:config.org::*GPG][GPG:1]]
  ;; (require 'epa-file)
  (epa-file-enable)
  (setf epa-pinentry-mode 'loopback)
;; GPG:1 ends here

;; [[file:config.org::*Passwords][Passwords:1]]
  (load-file "~/.passwords.el")
;; Passwords:1 ends here

;; [[file:config.org::*Other Configuration][Other Configuration:1]]
  (size-indication-mode 1)
  (line-number-mode -1)
;; Other Configuration:1 ends here

;; [[file:config.org::#org][Org-mode:1]]
(after! org
  (map! :leader
        :map org-mode-map
        :n "m b t t" 'org-table-toggle-column-width
        :nv "m b y" 'org-table-copy-region
        :nv "m b p" 'org-table-paste-rectangle
        :nv "m b d y" 'org-table-cut-region)
