config.org
*** Changing Defaults

#+begin_src emacs-lisp
(setq org-directory "~/Dropbox/org"
      org-default-notes-file (concat org-directory "/inbox.org")
      org-use-property-inheritance t
      org-log-done 'time
      org-list-allow-alphabetical t
      org-export-in-background nil
      org-catch-invisible-edits 'smart
      org-export-with-sub-superscripts '{}
      org-babel-default-header-args
      '((:session . "none")
        (:results . "replace")
        (:exports . "code")
        (:cache . "no")
        (:noweb . "no")
        (:hlines . "no")
        (:tangle . "no")
        (:comments . "link")))
#+end_src

*** org-roam

#+begin_src emacs-lisp
(use-package! org-roam
  :hook (after-init . org-roam-mode)
  :config
  (setq org-roam-directory "~/Dropbox/org-roam/"
        org-roam-db-location "~/Dropbox/org-roam/org-roam.db"
        org-roam-dailies-directory "daily/"
        org-roam-db-update-method 'immediate ;; could change later if it gets slow
        org-roam-tag-sources '(prop vanilla)
        org-roam-encrypt-files nil
        org-roam-graph-viewer "/Applications/Firefox.app/Contents/MacOS/firefox-bin"
        org-roam-dailies-capture-templates
        '(("j" "Journal" entry
           #'org-roam-capture--get-point
           "* %? :journal:\n:PROPERTIES:\n:LOGGED: %U\n:END:"
           :file-name "daily/daily-%<%Y-%m-%d>"
           :head "#+title: [%<%Y-%m-%d %a>]\n\n")
          ("s" "Sermon" plain
           #'org-roam-capture--get-point
           "* %? :sermon:faith:\n:PROPERTIES:\n:CATEGORY: faith\n:PASSAGE: \n:END:"
           :file-name "daily/daily-%<%Y-%m-%d>"
           :head "#+roam_tags: \n#+category: \n#+title: [%<%Y-%m-%d %a>]\n\n")
          ("c" "Conducting Lesson" plain
           #'org-roam-capture--get-point
           "* %? :conducting:"
           :file-name "daily/daily-%<%Y-%m-%d>"
           :head "#+title: [%<%Y-%m-%d>]\n\n")
          ("v" "Violin" entry
           #'org-roam-capture--get-point
           "* %?\n:PROPERTIES:\n:CATEGORY: %^{Category}\n:END:"
           :file-name "daily/daily-%<Y-%m-%d>"
           :head "#+title: [%<%Y-%m-%d>]\n\n"
           :olp ("Violin")))
        org-roam-capture-templates
        '(("d" "Default" plain
           #'org-roam-capture--get-point
           "%?"
           :file-name "%<%Y%m%d%H%M%S>-${slug}"
           :head "#+title: ${title}\n#+roam_tags:\n#+category: \n"
           :unnarrowed t)
          ("t" "Temporary" plain
           (function org-roam-capture--get-point)
           :file-name "temporary/%<%Y%m%d%H%M%S>-${slug}"
           :head "#+title: ${title}\n#+author: %(concat user-full-name)\n#+email: %(concat user-mail-address)\n#+created: %(format-time-string \"[%Y-%m-%d %H:%M]\")\n#+roam_tags:\n\n%?")
          ("e" "Entry" entry
           #'org-roam-capture--get-point
           "* %?\n%U\n"
           :file-name "%<%Y%m%d%H%M%S>-${slug}"
           :head "#+roam_tags: \n#+title: ${title}\n#+category: \n"
           :unnarrowed t)))
  (map! :leader
        (:prefix-map ("r" . "Roam")
         :desc "Roam" "l" #'org-roam
         :desc "Roam Find File" "f" #'org-roam-find-file
         :desc "Roam Graph" "g" #'org-roam-graph
         :desc "Roam Capture" "c" #'org-roam-capture
         :desc "Roam Refresh" "!" #'pgw/org-roam-refresh
         :desc "Roam Insert" "i" #'org-roam-insert
         (:prefix ("d" . "Dailies")
          :desc "Capture Today" "." #'org-roam-dailies-capture-today
          :desc "Capture Yesterday" "h" #'org-roam-dailies-capture-yesterday
          :desc "Capture Tomorrow" "l" #'org-roam-dailies-capture-tomorrow
          :desc "Capture Date" "d" #'org-roam-dailies-capture-date
          :desc "Find Date" "/" #'org-roam-dailies-find-date
          :desc "Find Next Note" "L" #'org-roam-dailies-find-next-note
          :desc "Find Prev Note" "H" #'org-roam-dailies-find-previous-note)))
  (org-roam-mode 1)
  (defun pgw/org-roam-refresh ()
    (interactive)
    (org-roam-db-build-cache :force)
    (org-roam-buffer--update-maybe :redisplay)))
#+end_src

*** ​Todo keywords

#+begin_src emacs-lisp
  (setq org-todo-keywords
        '((sequence "NEXT(n)" "TODO(t)" "IN-PROGRESS(i)" "WAITING(w)" "|" "DONE(d)" "CANCELLED(c)" "DELEGATED(g)")))
#+end_src

*** Tags
#+begin_src emacs-lisp
(setq org-tag-persistent-alist '(("noexport" . ?N))
      org-complete-tags-always-offer-all-agenda-tags nil)
#+end_src

*** Log when tasks are marked as done:
#+begin_src emacs-lisp
(setq org-log-done 'time) ; Log when task marked as done
#+end_src

*** Org Refile:
#+begin_src emacs-lisp
(setq pgw/refile-targets (file-expand-wildcards "~/Dropbox/org/*.org"))
(setq org-refile-targets '((nil :maxlevel . 9)
                           (org-agenda-files :maxlevel . 9)
                           (pgw/refile-targets :maxlevel . 9)))
(setq org-refile-use-outline-path 'file)
(setq org-outline-path-complete-in-steps nil)
(setq org-refile-allow-creating-parent-nodes 'confirm)
#+end_src

*** Agenda

#+begin_src emacs-lisp
;; org-agenda-auto-exclude-function
;; (defun pgw/org-my-auto-exclude-function (tag)
;;   (if
;;       (string= tag "officehours")
;;       (concat "-" tag)))
;; (setq org-agenda-auto-exclude-function 'pgw/org-my-auto-exclude-function)

;(setq org-agenda-overriding-columns-format "%28ITEM %TODO %SCHEDULED %DEADLINE %TAGS")

;; Re-align tags when window shape changes
(add-hook! 'org-agenda-mode-hook
          (lambda () (add-hook! 'window-configuration-change-hook 'org-agenda-align-tags nil t)))

;(add-hook! 'org-agenda-finalize-hook
;   'org-agenda-align-tags)

(setq org-deadline-warning-days 7)

(add-hook! 'org-agenda-finalize-hook
          (lambda ()
            (display-line-numbers-mode -1)
            ))

;; Org entries
(setq org-agenda-max-entries nil)


(after! org
  (map! :map evil-org-agenda-mode-map "SPC m l" #'org-agenda-log-mode))
#+end_src

