personal.el
    (setq org-roam-directory "~/Dropbox/org-roam/"
          org-roam-db-location "~/Dropbox/org-roam/org-roam.db"
          org-roam-dailies-directory "daily/"
          org-roam-db-update-method 'immediate ;; could change later if it gets slow
          org-roam-tag-sources '(prop vanilla)
          org-roam-encrypt-files nil
          org-roam-graph-viewer "/Applications/Firefox.app/Contents/MacOS/firefox-bin"
          org-roam-dailies-capture-templates
          '(("j" "Journal" entry
             #'org-roam-capture--get-point
             "* %? :journal:\n:PROPERTIES:\n:LOGGED: %U\n:END:"
             :file-name "daily/daily-%<%Y-%m-%d>"
             :head "#+title: [%<%Y-%m-%d %a>]\n\n")
            ("s" "Sermon" plain
             #'org-roam-capture--get-point
             "* %? :sermon:faith:\n:PROPERTIES:\n:CATEGORY: faith\n:PASSAGE: \n:END:"
             :file-name "daily/daily-%<%Y-%m-%d>"
             :head "#+roam_tags: \n#+category: \n#+title: [%<%Y-%m-%d %a>]\n\n")
            ("c" "Conducting Lesson" plain
             #'org-roam-capture--get-point
             "* %? :conducting:"
             :file-name "daily/daily-%<%Y-%m-%d>"
             :head "#+title: [%<%Y-%m-%d>]\n\n")
            ("v" "Violin" entry
             #'org-roam-capture--get-point
             "* %?\n:PROPERTIES:\n:CATEGORY: %^{Category}\n:END:"
             :file-name "daily/daily-%<Y-%m-%d>"
             :head "#+title: [%<%Y-%m-%d>]\n\n"
             :olp ("Violin")))
          org-roam-capture-templates
          '(("d" "Default" plain
             #'org-roam-capture--get-point
             "%?"
             :file-name "%<%Y%m%d%H%M%S>-${slug}"
             :head "#+title: ${title}\n#+roam_tags:\n#+category: \n"
             :unnarrowed t)
            ("t" "Temporary" plain
             (function org-roam-capture--get-point)
             :file-name "temporary/%<%Y%m%d%H%M%S>-${slug}"
             :head "#+title: ${title}\n#+author: %(concat user-full-name)\n#+email: %(concat user-mail-address)\n#+created: %(format-time-string \"[%Y-%m-%d %H:%M]\")\n#+roam_tags:\n\n%?")
            ("e" "Entry" entry
             #'org-roam-capture--get-point
             "* %?\n%U\n"
             :file-name "%<%Y%m%d%H%M%S>-${slug}"
             :head "#+roam_tags: \n#+title: ${title}\n#+category: \n"
             :unnarrowed t))))
  (setq pgw/refile-targets (file-expand-wildcards "~/Dropbox/org/*.org"))
  )
;; Org-mode:2 ends here

;; [[file:config.org::*exec-path-from-shell][exec-path-from-shell:1]]
(when IS-MAC
