config.el
    (setq org-agenda-custom-commands
          '(("c" . "Columbia")
            ("cf" . "Columbia Friend Schedules")
            ("cfe" "Ellie's Schedule" agenda ""
             ((org-agenda-span 7)
              (org-agenda-files
               (file-expand-wildcards "~/Dropbox/org/notes/columbia/2021_fall/calendar/2021_fall_ellie.org"))))
            ("cfk" "Kaeon's Schedule" agenda ""
             ((org-agenda-span 7)
              (org-agenda-files
               (file-expand-wildcards "~/Dropbox/org/notes/columbia/2021_fall/calendar/2021_fall_kaeon.org"))))
            ("l" "Logging View" agenda ""
             ((org-agenda-span 1)
              (org-agenda-files
               (file-expand-wildcards "~/Dropbox/org/*.org"))))
            ("A" "General Agenda" agenda ""
             ((org-agenda-span 1)
              (org-agenda-sorting-strategy
               '((agenda habit-down time-up deadline-up)))))
            ("D" "College Deadlines" tags-todo "+collegeapps")
            ("Q" . "Custom queries")
            ("Qa" "Query all (Archive included)" search ""
             ((org-agenda-files (append (file-expand-wildcards (concat org-directory "/*.org"))
                                        (file-expand-wildcards (concat org-directory "/*.org_archive"))))))
            ("Ql" "Query Links" search ""
             ((org-agenda-files (list (concat org-directory "/links.org")
                                      (concat org-directory "/links.org_archive")))))))
  (setq org-agenda-files (append (file-expand-wildcards "~/Dropbox/org/*.org")
                                 (file-expand-wildcards "~/Dropbox/org/*.org.gpg")
                                 (file-expand-wildcards "~/Dropbox/org/calendars/*.org")))
  
  (defun pgw/org-agenda-reload-files ()
    (interactive)
    (setq org-agenda-files (append (file-expand-wildcards "~/Dropbox/org/*.org")
                                   (file-expand-wildcards "~/Dropbox/org/*.org.gpg")
                                   (file-expand-wildcards "~/Dropbox/org/calendars/*.org"))))
    (setq org-agenda-time-grid '((daily today require-timed)
                                 (600 800 1000 1200 1400 1600 1800 2000 2200)
                                 "......" "----------------"))
  (defun pgw/year-month ()
    "Custom function to return date in format: YYYY-MM"
    (format-time-string "%Y-%m"))
  
  (defun pgw/U ()
    "Custom function to return date in org inactive timestamp format"
    (format-time-string "[%Y-%m-%d %a]"))
  
  (defun pgw/add-12 ()
    "Custom function return active org timestamp with exactly 24 hour difference"
    (format-time-string "%Y-%m-%d %a %H:%M" (time-add (current-time) 85500)))
  
  (defun pgw/headline_date ()
    "Function to find the date as headline for Violin capture template"
    (goto-char (point-min))
    (let ((searchresults (search-forward (format-time-string "[%Y-%m-%d %a]") nil t)))
      (if searchresults
          'searchresults
        (error "Not found! Use Vc to create today's practice first."))))
  (setq org-capture-templates
        (doct '(("Inboxes" :keys "i"
                 :file "~/Dropbox/org/inbox.org"
                 :type entry
                 :template ("* %?")
                 :children (("Flexible Entry" :keys "i")
                            ("Todo" :keys "t"
                             :template ("* TODO %?"))
                            ("Notes Entry" :keys "n"
                             :file "~/Dropbox/org/notes.org"
                             :template ("* %?"
                                        "%U"))
                            ("Link" :keys "l"
                             :file "~/Dropbox/org/links.org"
                             :headline "!Inbox"
                             :prepend t
                             :template ("* [[%?%:link][%:description]]"
                                        "%U"))))
                ("Finances" :keys "f"
                 :file "~/Dropbox/org/finances.org.gpg"
                 :children (("Credit Card Transaction" :keys "c"
                             :headline "Nordstrom Card"
                             :type table-line
                             :table-line-pos "III-1"
                             :template ("| | %? | |"))))
                ("Events" :keys "e"
                 :type entry
                 :children (("Emacs Entry (Not Synced)" :keys "f"
                             :file "~/Dropbox/org/events.org")
                            ("Emacs Calendar" :keys "e"
                             :file "~/Dropbox/org/calendars/cal_emacs.org"
                             :template ("* %^{Title of event}"
                                        "SCHEDULED: %^{Scheduled time + duration}T"
                                        ":PROPERTIES:"
                                        ":calendar-id: ihfv2u5n9uf5ksj5484vbe7mj4@group.calendar.google.com"
                                        ":END:"
                                        ":org-gcal:%?"
                                        ":END:"))
                            ("Emacs Calendar" :keys "g"
                             :file "~/Dropbox/org/calendars/cal_gmail.org"
                             :template ("* %^{Title of event}"
                                        "SCHEDULED: %^{Scheduled time + duration}T"
                                        ":PROPERTIES:"
                                        ":calendar-id: pierce.g.wang@gmail.com"
                                        ":END:"
                                        ":org-gcal:%?"
                                        ":END:"))))
                ("Stuff and Things" :keys "s"
                 :file "~/Dropbox/org/notes/stuff_and_things/organizing_temp.org"
                 :children (("Database Entry" :keys "i"
                             :type entry
                             :template ("* DECIDE %?"
                             "%U"))
                            ("Packing for College" :keys "p"
                             :type entry
                             :file "~/Dropbox/org-roam/temporary/20210805114431-packing_for_college.org"
                             :contexts (:in-file "20210805114431-packing_for_college.org")
                             :template ("* DONE Item"
                                        "%^{TYPE}p"
                                        "%^{QUANTITY}p"
                                        "%^{COLOR}p"
                                        "%^{FIT}p"
                                        "%^{NOTES}p")
                             :children (("Shirts" :keys "s"
                                         :headline "Shirts")
                                        ("Pants" :keys "p"
                                         :headline "Pants")
                                        ("Other" :keys "o"
                                         :headline "Other")))
                            ("Violin Repertoire" :keys "m"
                             :type entry
                             :id "e48fe999-3716-425b-8445-fce296c7635a"
                             :contexts (:in-file "repertoire.org")
                             :template ("* - %?"
                                        "%^{COMPOSER}p"
                                        "%^{ARRANGEMENT}p")))))))
  
    ;; Set to the name of the file where new notes will be stored
    (setq org-mobile-inbox-for-pull "~/Dropbox/Apps/MobileOrg/index.org")
    ;; Set to <your Dropbox root directory>/MobileOrg.
    (setq org-mobile-directory "~/Dropbox/Apps/MobileOrg")
