config.org
*** Crypt

#+begin_src emacs-lisp
(use-package! org-crypt
  :config
  (org-crypt-use-before-save-magic)
  (setq org-tags-exclude-from-inheritance (quote ("crypt")))

  (setq org-crypt-key "pierce.g.wang@gmail.com")
  ;; GPG key to use for encryption
  ;; Either the Key ID or set to nil to use symmetric encryption.

  (setq auto-save-default nil)
  ;; Auto-saving does not cooperate with org-crypt.el: so you need
  ;; to turn it off if you plan to use org-crypt.el quite often.
  ;; Otherwise, you'll get an (annoying) message each time you
  ;; start Org.

  ;; To turn it off only locally, you can insert this:
  ;;
  ;; # -*- buffer-auto-save-file-name: nil; -*-
  (map! :leader
        (:prefix-map ("k" . "org-crypt")
         :desc "Org Encrypt Entry" "e" #'org-encrypt-entry
         :desc "Org Decrypt Entry" "d" #'org-decrypt-entry)))
#+end_src

*** Babel

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (org-babel-do-load-languages 'org-babel-load-languages
                                 '((python . t)
                                   (c . t)
                                   (ditaa . t)
                                   )))
#+end_src

*** Org-drill

#+begin_src emacs-lisp
  ;;; org-drill
  (use-package! org-drill)
#+end_src

*** Latex
#+begin_src emacs-lisp
  (require 'ox-latex)
#+end_src

**** CDLatex
#+begin_src emacs-lisp
  (use-package! cdlatex
    :after org
    :config
    (add-hook! 'org-mode-hook #'org-cdlatex-mode)
    (add-to-list 'org-tab-first-hook 'org-try-cdlatex-tab)
    )
#+end_src

**** Fragments



#+begin_src emacs-lisp
  (setq org-format-latex-options
        ;; '(:foreground "#000000" :background default ;; light theme
        '(:foreground "#d6d6d4" :background default ;; dark tieme
                      :scale 1.0
                      :html-foreground "Black" :html-background "Transparent"
                      :html-scale 1.0
                      :matchers ("begin" "$1" "$" "$$" "\\(" "\\[")))
#+end_src

Fix color handling in org-preview-latex-fragment

#+begin_src emacs-lisp
  (let ((dvipng--plist (alist-get 'dvipng org-preview-latex-process-alist)))
    (plist-put dvipng--plist :use-xcolor t)
    (plist-put dvipng--plist :image-converter '("dvipng -D %D -T tight -o %O %f")))
#+end_src

#+begin_src emacs-lisp :tangle no
  (global-set-key (kbd "C-c C-x C-l") 'org-toggle-latex-fragment)
#+end_src

*** Org Superstar (Bullets revamped)
#+begin_src emacs-lisp
  (use-package! org-superstar
    :config
    (setq org-superstar-prettify-item-bullets t)
    :hook (org-mode . org-superstar-mode))

#+end_src

*** Export
**** Export Publishing
#+begin_src emacs-lisp
  (require 'ox-publish)
  (setq org-publish-project-alist
        '(("pages-notes"
           :base-directory "~/Dropbox/org_publish/"
           :base-extension "org"
           :publishing-directory "~/Documents/github/github_pages/"
           :recursive t
           :publishing-function org-html-publish-to-html
           :headline-levels 4             ; Just the default for this project.
           ;; :html-head "<link rel=\"stylesheet\" type=\"text/css\" href=\"css/style.css\"/>"
           :auto-preamble t
           )
          ("pages-static"
           :base-directory "~/Dropbox/org_publish/"
           :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|jpeg\\|txt\\|json"
           :publishing-directory "~/Documents/github/github_pages/"
           :recursive t
           :publishing-function org-publish-attachment
           )
          ("pages" :components ("pages-notes" "pages-static"))
          ))
#+end_src

**** HTML

#+begin_src emacs-lisp
  (setq org-html-validation-link nil)
#+end_src

**** ODT

#+begin_src emacs-lisp
(setq org-odt-styles-file "~/.doom.d/odt/mla.ott")
#+end_src

*** DISABLED org-noter: PDF Annotation
CLOSED: [2021-11-29 Mon 16:54]
Obsolete because of PDF reader in Doom.

#+begin_src emacs-lisp :tangle no
  (use-package! org-noter
    :after org
    :ensure t
    :config
    (setq org-noter-default-notes-file-names '("notes.org")
          org-noter-notes-search-path '("~/Dropbox/org/notes"))
    )
#+end_src

*** org-gcal: Calendar Integration
Calendar Setup:
#+begin_src emacs-lisp :tangle yes
(use-package! org-gcal
  :config
  (map! :leader
        (:prefix-map ("d" . "Gcal Commands")
         :desc "Post to gcal" "p" #'org-gcal-post-at-point
         :desc "Sync with gcal" "s" #'org-gcal-sync
         :desc "Fetch from gcal" "f" #'org-gcal-fetch
         :desc "Delete at point" "d" #'org-gcal-delete-at-point
         :desc "Sync current buffer" "b s" #'org-gcal-sync-buffer
         :desc "Fetch current buffer" "b f" #'org-gcal-fetch-buffer))
  (setq org-gcal-client-id pgw/org-gcal-client-id
        org-gcal-client-secret pgw/org-gcal-client-secret
        org-gcal-file-alist pgw/org-gcal-file-alist
        org-gcal-local-timezone "America/New_York"
        org-gcal-notify-p nil
        org-gcal-up-days 60)
  (setq org-gcal-remove-api-cancelled-events t))
#+end_src

*** org-reveal

#+begin_src emacs-lisp
  (setq org-reveal-root "file:///Users/piercewang/Documents/projects/revealjs/reveal.js-4.1.0")
#+end_src

*** ~Darkroom~ for Writing
#+begin_src emacs-lisp
  (use-package! darkroom)
#+end_src
** Company mode
Disable automatic completion from company--slows everything down a bit.
#+begin_src emacs-lisp
(setq company-idle-delay nil) ;; original 0.2
#+end_src

** LaTeX
#+begin_src emacs-lisp
  (setq TeX-engine 'xetex)
  (setq latex-run-command "xetex")
#+end_src

*** AUCTEX
#+begin_src emacs-lisp
  (use-package! tex
    :ensure auctex
    :defer t
    :config
    (setq TeX-auto-save t))
#+end_src

*** Classes - Adding Academic XeTeX Times New Roman Class

#+begin_src emacs-lisp
(after! ox-latex
  (add-to-list 'org-latex-classes
               '("Times"
                 "\\documentclass[12pt]{article}
\\usepackage{fontspec}
\\setmainfont{Times New Roman}
\\usepackage{hyperref}"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
  (add-to-list 'org-latex-classes
               '("COMSW3203"
                 "\\documentclass{article}
\\usepackage{amsmath}
\\usepackage{amsfonts}"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
#+end_src


** Macros

*** Macro Query
#+begin_src emacs-lisp
  (defun my-macro-query (arg)
    "Prompt for input using minibuffer during kbd macro execution.
  With prefix argument, allows you to select what prompt string to use.
  If the input is non-empty, it is inserted at point."
    (interactive "P")
    (let* ((query (lambda () (kbd-macro-query t)))
           (prompt (if arg (read-from-minibuffer "PROMPT: ") "Input: "))
           (input (unwind-protect
                      (progn
                        (add-hook! 'minibuffer-setup-hook query)
                        (read-from-minibuffer prompt))
                    (remove-hook 'minibuffer-setup-hook query))))
      (unless (string= "" input) (insert input))))
  (global-set-key "\C-xQ" 'my-macro-query)
#+end_src

** Mac OS

*** exec-path-from-shell

#+begin_src emacs-lisp
(when IS-MAC
  (use-package! exec-path-from-shell
    :config
    (setq exec-path-from-shell-shell-name "/bin/zsh"))
  (exec-path-from-shell-initialize))
#+end_src

** Shell
#+begin_src emacs-lisp
(setq shell-file-name "/bin/zsh")
#+end_src

** Magit
#+begin_src emacs-lisp
  (use-package! magit
    :config
    (global-set-key (kbd "C-x g") 'magit-status))
#+end_src

** Backups
#+begin_src emacs-lisp
  (setq backup-directory-alist '(("." . "~/org/backup"))
    backup-by-copying t    ; Don't delink hardlinks
    version-control t      ; Use version numbers on backups
    delete-old-versions t  ; Automatically delete excess backups
    kept-new-versions 20   ; how many of the newest versions to keep
    kept-old-versions 5    ; and how many of the old
    )
#+end_src

