config.el
    (use-package! org-crypt
      :config
      (org-crypt-use-before-save-magic)
      (setq org-tags-exclude-from-inheritance (quote ("crypt")))
  
      (setq org-crypt-key "3C44F187958295E4")
      ;; GPG key to use for encryption
      ;; Either the Key ID or set to nil to use symmetric encryption.
  
      (setq auto-save-default nil)
      ;; Auto-saving does not cooperate with org-crypt.el: so you need
      ;; to turn it off if you plan to use org-crypt.el quite often.
      ;; Otherwise, you'll get an (annoying) message each time you
      ;; start Org.
  
      ;; To turn it off only locally, you can insert this:
      ;;
      ;; # -*- buffer-auto-save-file-name: nil; -*-
      :bind (("C-c s-d e" . org-encrypt-entry)
             ("C-c s-d d" . org-decrypt-entry))
      )
    (with-eval-after-load 'org
      (org-babel-do-load-languages 'org-babel-load-languages
                                   '((python . t)
                                     )))
    ;;; org-drill
    (use-package! org-drill)
    (require 'ox-latex)
    (use-package! cdlatex
      :after org
      :config
      (add-hook! 'org-mode-hook #'org-cdlatex-mode)
      (add-to-list 'org-tab-first-hook 'org-try-cdlatex-tab)
      )
    (setq org-format-latex-options
          ;; '(:foreground "#000000" :background default ;; light theme
          '(:foreground "#d6d6d4" :background default ;; dark theme
                        :scale 1.1
                        :html-foreground "Black" :html-background "Transparent"
                        :html-scale 1.0
                        :matchers ("begin" "$1" "$" "$$" "\\(" "\\[")))
    (let ((dvipng--plist (alist-get 'dvipng org-preview-latex-process-alist)))
      (plist-put dvipng--plist :use-xcolor t)
      (plist-put dvipng--plist :image-converter '("dvipng -D %D -T tight -o %O %f")))
    (global-set-key (kbd "C-c C-x C-l") 'org-toggle-latex-fragment)
    (use-package! org-superstar
      :config
      (setq org-superstar-prettify-item-bullets t)
      :hook (org-mode . org-superstar-mode))
  
    (require 'ox-publish)
    (setq org-publish-project-alist
          '(("pages-notes"
             :base-directory "~/Dropbox/org_publish/"
             :base-extension "org"
             :publishing-directory "~/Documents/Projects/Github/github_pages/"
             :recursive t
             :publishing-function org-html-publish-to-html
             :headline-levels 4             ; Just the default for this project.
             ;; :html-head "<link rel=\"stylesheet\" type=\"text/css\" href=\"css/style.css\"/>"
             :auto-preamble t
             )
            ("pages-static"
             :base-directory "~/Dropbox/org_publish/"
             :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|jpeg"
             :publishing-directory "~/Documents/Projects/Github/github_pages/"
             :recursive t
             :publishing-function org-publish-attachment
             )
            ("pages" :components ("pages-notes" "pages-static"))
            ))
    (setq org-html-validation-link nil)
    (use-package! org-noter
      :after org
      :ensure t
      :config
      (setq org-noter-default-notes-file-names '("notes.org")
            org-noter-notes-search-path '("~/Dropbox/org/notes"))
      )
  (use-package! org-gcal
    :bind (("C-c s-g p" . org-gcal-post-at-point)
           ("C-c s-g s" . org-gcal-sync)
           ("C-c s-g f" . org-gcal-fetch)
           ("C-c s-g d" . org-gcal-delete-at-point)
           ("C-c s-g b s" . org-gcal-sync-buffer)
           ("C-c s-g b f" . org-gcal-sync-buffer))
    :config
    (setq org-gcal-client-id pgw/org-gcal-client-id
          org-gcal-client-secret pgw/org-gcal-client-secret
          org-gcal-file-alist pgw/org-gcal-file-alist
          org-gcal-local-timezone "America/New_York"
          org-gcal-notify-p nil)
    (setq org-gcal-remove-api-cancelled-events t))
    (setq org-reveal-root "file:///Users/piercewang/Documents/projects/revealjs/reveal.js-4.1.0")
    (use-package! darkroom)
  )
;; Org-mode:1 ends here

;; [[file:config.org::*org-gcal: Calendar Integration][org-gcal: Calendar Integration:1]]
(use-package! org-gcal
  :bind (("C-c s-g p" . org-gcal-post-at-point)
         ("C-c s-g s" . org-gcal-sync)
         ("C-c s-g f" . org-gcal-fetch)
         ("C-c s-g d" . org-gcal-delete-at-point)
         ("C-c s-g b s" . org-gcal-sync-buffer)
         ("C-c s-g b f" . org-gcal-sync-buffer))
  :config
  (setq org-gcal-client-id pgw/org-gcal-client-id
        org-gcal-client-secret pgw/org-gcal-client-secret
        org-gcal-file-alist pgw/org-gcal-file-alist
        org-gcal-local-timezone "America/New_York"
        org-gcal-notify-p nil)
  (setq org-gcal-remove-api-cancelled-events t))
;; org-gcal: Calendar Integration:1 ends here

;; [[file:config.org::*Company mode][Company mode:1]]
(setq company-idle-delay nil) ;; original 0.2
;; Company mode:1 ends here

;; [[file:config.org::*LaTeX][LaTeX:1]]
  (setq TeX-engine 'xetex)
  (setq latex-run-command "xetex")
;; LaTeX:1 ends here

;; [[file:config.org::*AUCTEX][AUCTEX:1]]
  (use-package! tex
    :ensure auctex
    :defer t
    :config
    (setq TeX-auto-save t))
;; AUCTEX:1 ends here

;; [[file:config.org::*Classes - Adding Academic XeTeX Times New Roman Class][Classes - Adding Academic XeTeX Times New Roman Class:1]]
(after! ox-latex
  (add-to-list 'org-latex-classes
               '("Times"
                 "\\documentclass[12pt]{article}
\\usepackage{fontspec}
\\setmainfont{Times New Roman}
\\usepackage{hyperref}"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
;; Classes - Adding Academic XeTeX Times New Roman Class:1 ends here

;; [[file:config.org::*Macro Query][Macro Query:1]]
  (defun my-macro-query (arg)
    "Prompt for input using minibuffer during kbd macro execution.
  With prefix argument, allows you to select what prompt string to use.
  If the input is non-empty, it is inserted at point."
    (interactive "P")
    (let* ((query (lambda () (kbd-macro-query t)))
           (prompt (if arg (read-from-minibuffer "PROMPT: ") "Input: "))
           (input (unwind-protect
                      (progn
                        (add-hook! 'minibuffer-setup-hook query)
                        (read-from-minibuffer prompt))
                    (remove-hook 'minibuffer-setup-hook query))))
      (unless (string= "" input) (insert input))))
  (global-set-key "\C-xQ" 'my-macro-query)
;; Macro Query:1 ends here

;; [[file:config.org::*Magit][Magit:1]]
  (use-package! magit
    :config
    (global-set-key (kbd "C-x g") 'magit-status))
;; Magit:1 ends here

;; [[file:config.org::*Backups][Backups:1]]
  (setq backup-directory-alist '(("." . "~/org/backup"))
    backup-by-copying t    ; Don't delink hardlinks
    version-control t      ; Use version numbers on backups
    delete-old-versions t  ; Automatically delete excess backups
    kept-new-versions 20   ; how many of the newest versions to keep
    kept-old-versions 5    ; and how many of the old
    )
;; Backups:1 ends here
