personal.el
  (use-package! exec-path-from-shell
    :config
    (setq exec-path-from-shell-shell-name "/bin/zsh"))
  (exec-path-from-shell-initialize))
;; exec-path-from-shell:1 ends here

;; [[file:config.org::*Shell][Shell:1]]
(setq shell-file-name "/bin/zsh")
;; Shell:1 ends here
