config.org
** Daemon
#+begin_src emacs-lisp
  ;;(if 'server-process
  ;;    (server-start))
  (load "server")
  (unless (server-running-p) (server-start))
#+end_src

** Revert Mode
For files changed by dropbox and also dired buffers.
#+begin_src emacs-lisp
  (global-auto-revert-mode 1)
  (add-hook! 'after-revert-hook 'org-element-cache-reset)
#+end_src

** Calendar
#+begin_src emacs-lisp
(setq calendar-latitude 37.759995)
(setq calendar-longitude -122.427046)
(setq calendar-location-name "San Francisco, CA")
#+end_src

*** Date Style
Set date style to ISO
#+begin_src emacs-lisp
(calendar-set-date-style 'iso)
#+end_src

** Artist Mode

Artist mode is amazing! Configure some quick keybinds...
#+begin_src emacs-lisp
(add-hook! 'artist-mode-hook
          (lambda ()
            (display-line-numbers-mode -1)
            (evil-emacs-state)
            (local-set-key (kbd "<f1>") 'artist-select-op-poly-line)
            (local-set-key (kbd "<f2>") 'artist-select-op-pen-line)
            (local-set-key (kbd "<f3>") 'artist-select-op-line)
            (local-set-key (kbd "<f4>") 'artist-select-op-square)
            (local-set-key (kbd "<f5>") 'artist-select-op-ellipse))
          )
#+end_src

Also remember, can use <middle mouse button> to see the menu of options.

** Image Mode
#+begin_src emacs-lisp
  (add-hook! 'image-mode-hook
            (lambda ()
              (display-line-numbers-mode -1)
              (evil-emacs-state))
            )
#+end_src

** Flyspell mode
Activate =flyspell-mode= automatically in all school files.
#+begin_src elisp
  (defun pgw/turn-on-flyspell-hook ()
    (if (or (string-match "^/Users/piercewang/Google Drive/OHS/" (if (eq buffer-file-name nil) "" buffer-file-name))
            (string-match "^/Users/piercewang/Dropbox/org/notes/college/" (if (eq buffer-file-name nil) "" buffer-file-name)))
        (flyspell-mode 1)))

  (add-hook! 'org-mode-hook 'turn-on-flyspell)
#+end_src
** Calc

#+begin_src emacs-lisp
(evil-set-initial-state 'calc-mode 'emacs)
#+end_src

** Games
*** Tetris

I love Emacs Tetris!

#+begin_src emacs-lisp
(use-package! tetris
  :bind (:map tetris-mode-map
         ("z" . tetris-rotate-next)
         ("x" . tetris-rotate-prev)
         ("k" . tetris-move-bottom)
         ("h" . tetris-move-left)
         ("j" . tetris-move-down)
         ("l" . tetris-move-right)))
#+end_src

*** 2048

#+begin_src emacs-lisp
(use-package! 2048-game
  :bind (:map 2048-mode-map
              ("h" . 2048-left)
              ("j" . 2048-down)
              ("k" . 2048-up)
              ("l" . 2048-right)))
#+end_src

** ERC
#+begin_src emacs-lisp
  (setq erc-log-channels-directory "~/logs/")
  (setq erc-save-buffer-on-part t)
  (map! :leader "e e" (lambda () (interactive) (erc :server "irc.freenode.net" :port 6667 :nick "tesrodome" :password passwords_ERC)))
#+end_src

** Keybinds
#+begin_src emacs-lisp
  ;;; replace-regexp
  (global-set-key (kbd "C-M-$") 'replace-regexp)

  ;;; Open .emacs.d
  (global-set-key (kbd "H-C-M-e") (lambda () (interactive) (dired "~/.emacs.d/")))

  ;;; Regular find-file
  (global-set-key (kbd "H-C-x o") (lambda () (interactive) (switch-to-buffer "*Org Agenda*")))


  ;;; Close window
  (global-set-key (kbd "s-0") 'delete-window)
#+end_src

Insert Org-mode Image
#+begin_src emacs-lisp
  (global-set-key (kbd "<f8>") 'insert-org-image)
#+end_src

*** which-key
#+begin_src emacs-lisp
(use-package! which-key
  :config
  (which-key-mode)
  (setq which-key-popup-type 'side-window)
  (setq which-key-side-window-location 'bottom)
  (setq which-key-idle-delay 2.5))
#+end_src

*** Line Moving

#+begin_src emacs-lisp
(map! :n "j" 'next-line
      :n "k" 'previous-line
      :v "j" 'next-line
      :v "k" 'previous-line)
#+end_src

** Hydra for Resizing Windows

Functions to change:
~(enlarge-window)~
~(shrink-window-horizontally)~
~(enlarge-window-horizontally)~

#+begin_src emacs-lisp
  (defhydra hydra-windowmanage (global-map "H-c ^")
    "Hydra for window management."
    ("=" enlarge-window "+Vertical")
    ("-" (enlarge-window -1) "-Vertical")
    ("]" enlarge-window-horizontally "+Horizontal")
    ("[" shrink-window-horizontally "-Horizontal")
    ("q" nil "Quit"))

  (global-set-key (kbd "C-c C-6") 'hydra-windowmanage/body)
#+end_src

** User Configuration
#+begin_src emacs-lisp
(setq user-full-name "Pierce Wang"
      user-mail-address "pierce.g.wang@gmail.com")
#+end_src

** Buffer Mangement

*** DISABLED IBuffer
CLOSED: [2020-11-24 Tue 00:50]
#+begin_src emacs-lisp :tangle no
  (use-package! ibuffer
    :config
    (global-set-key (kbd "C-x C-b") 'ibuffer))
  (setq ibuffer-saved-filter-groups
        '(("default"
           ("emacs-config" (or (filename . "/.emacs.d/")
                               (filename . ".emacs.d/init.el")))
           ("OHS" (filename . "/Google Drive/OHS/"))
           ("Org" (filename . "/Dropbox/org/"))
           ("planner" (or
                      (name . "\*Calendar\*")
                      (name . "\*Org Agenda\*")
                      (name . "^diary$")))
           ;; ("Helm" (name . "\*helm.*"))
           ("Magit" (mode . Magit))
           ("ERC" (mode . erc-mode))
           ("Help" (or (name . "\*Help\*")
                       (name . "\*info\*")
                       (name . "\*GNU Emacs\*"))))))

  (add-hook! 'ibuffer-mode-hook
            (lambda ()
              (ibuffer-switch-to-saved-filter-groups "default")))
  (define-key ibuffer-mode-map (kbd "P") nil)
#+end_src

*** Bufler - Alphapapa

#+begin_src emacs-lisp :tangle no
  (use-package! bufler
    :bind (("C-x C-b" . bufler))
           ;; ("C-x b" . bufler-switch-buffer))
    :config
    (setf bufler-groups
          (bufler-defgroups
            (group
             ;; Subgroup collecting all named workspaces.
             (auto-workspace))
            (group
             ;; Subgroup collecting all `help-mode' and `info-mode' buffers.
             (group-or "*Help/Info*"
                       (mode-match "*Help*" (rx bos "help-"))
                       (mode-match "*Info*" (rx bos "info-"))))
            (group
             ;; Subgroup collecting all special buffers (i.e. ones that are not
             ;; file-backed), except `magit-status-mode' buffers (which are allowed to fall
             ;; through to other groups, so they end up grouped with their project buffers).
             (group-and "*Special*"
                        (lambda (buffer)
                          (unless (or (funcall (mode-match "Magit" (rx bos "magit-status"))
                                               buffer)
                                      (funcall (mode-match "Dired" (rx bos "dired"))
                                               buffer)
                                      (funcall (auto-file) buffer))
                            "*Special*")))
             (group
              ;; Subgroup collecting these "special special" buffers
              ;; separately for convenience.
              (name-match "**Special**"
                          (rx bos "*" (or "Messages" "Warnings" "scratch" "Backtrace") "*")))
             (group
              ;; Subgroup collecting all other Magit buffers, grouped by directory.
              (mode-match "*Magit* (non-status)" (rx bos (or "magit" "forge") "-"))
              (auto-directory))
             ;; Remaining special buffers are grouped automatically by mode.
             (auto-mode))
            ;; All buffers under "~/.emacs.d" (or wherever it is).
            (dir doom-emacs-dir)
            (group
             ;; Subgroup collecting buffers in `org-directory' (or "~/org" if
             ;; `org-directory' is not yet defined).
             (dir (if (bound-and-true-p org-directory)
                      org-directory
                    "~/org"))
             (dir "~/Dropbox/org/notes/")
             (dir "~/Dropbox/org/notes/college/essays/" 1)
             (group
              ;; Subgroup collecting indirect Org buffers, grouping them by file.
              ;; This is very useful when used with `org-tree-to-indirect-buffer'.
              (auto-indirect)
              (auto-file))
             ;; Group remaining buffers by whether they're file backed, then by mode.
             (group-not "*special*" (auto-file))
             (auto-mode))
            (group
             ;; Subgroup for OHS things
             (dir "~/Google Drive/OHS/")
             (dir "~/Google Drive/OHS/12th Grade/Classes/" 1)
             (dir "~/Google Drive/OHS/11th Grade/" 2)
             ;; Group remaining buffers by whether they're file backed, then by mode.
             (group-not "*special*" (auto-file))
             (auto-mode))
            (dir "/Volumes/" 1)
            (group
             ;; Subgroup collecting buffers in a projectile project.
             (auto-projectile))
            (group
             ;; Subgroup collecting buffers in a version-control project,
             ;; grouping them by directory.
             (auto-project))
            ;; Group remaining buffers by directory, then major mode.
            (auto-directory)
            (auto-mode))))
#+end_src

** Dired
#+begin_src emacs-lisp
(setq delete-by-moving-to-trash t)
(setq dired-use-ls-dired t)
(cond ((eq system-type 'darwin) (setq insert-directory-program "/usr/local/bin/gls"
                                      trash-directory "~/.Trash"))
      ((eq system-type 'gnu/linux) (setq insert-directory-program "/usr/bin/ls"
                                         trash-directory "~/local/share/Trash")))
#+end_src

Make moving files easier between two split buffers.
#+begin_src emacs-lisp
  (setq dired-dwim-target t)
#+end_src

Remove print option to not accidentally print
#+begin_src emacs-lisp
  (define-key dired-mode-map (kbd "P") nil)
#+end_src

Custom dired open file function
#+begin_src emacs-lisp
  (define-key dired-mode-map (kbd "O") 'pgw/dired-open-file)
#+end_src

Symlinking
#+begin_src emacs-lisp
  (define-key dired-mode-map (kbd "Y") 'dired-do-symlink)
#+end_src

Move

*** Human readable format for ls switches (=-h=)
#+begin_src emacs-lisp
  (setq dired-listing-switches "-alh")
  (setq dired-actual-switches "-alh")
#+end_src


