config.el

;; [[file:config.org::*Daemon][Daemon:1]]
  ;;(if 'server-process
  ;;    (server-start))
  (load "server")
  (unless (server-running-p) (server-start))
;; Daemon:1 ends here

;; [[file:config.org::*Revert Mode][Revert Mode:1]]
  (global-auto-revert-mode 1)
;; Revert Mode:1 ends here

;; [[file:config.org::*Calendar][Calendar:1]]
(setq calendar-latitude 37.759995)
(setq calendar-longitude -122.427046)
(setq calendar-location-name "San Francisco, CA")
;; Calendar:1 ends here

;; [[file:config.org::*Date Style][Date Style:1]]
(calendar-set-date-style 'iso)
;; Date Style:1 ends here

;; [[file:config.org::*Artist Mode][Artist Mode:1]]
(add-hook! 'artist-mode-hook
          (lambda ()
            (display-line-numbers-mode -1)
            (evil-emacs-state)
            (local-set-key (kbd "<f1>") 'artist-select-op-poly-line)
            (local-set-key (kbd "<f2>") 'artist-select-op-pen-line)
            (local-set-key (kbd "<f3>") 'artist-select-op-line)
            (local-set-key (kbd "<f4>") 'artist-select-op-square)
            (local-set-key (kbd "<f5>") 'artist-select-op-ellipse))
          )
;; Artist Mode:1 ends here

;; [[file:config.org::*Image Mode][Image Mode:1]]
  (add-hook! 'image-mode-hook
            (lambda ()
              (display-line-numbers-mode -1)
              (evil-emacs-state))
            )
;; Image Mode:1 ends here

;; [[file:config.org::*Flyspell mode][Flyspell mode:1]]
  (defun pgw/turn-on-flyspell-hook ()
    (if (or (string-match "^/Users/piercewang/Google Drive/OHS/" (if (eq buffer-file-name nil) "" buffer-file-name))
            (string-match "^/Users/piercewang/Dropbox/org/notes/college/" (if (eq buffer-file-name nil) "" buffer-file-name)))
        (flyspell-mode 1)))

  (add-hook! 'org-mode-hook 'turn-on-flyspell)
;; Flyspell mode:1 ends here

;; [[file:config.org::*Calc][Calc:1]]
(evil-set-initial-state 'calc-mode 'emacs)
;; Calc:1 ends here

;; [[file:config.org::*Tetris][Tetris:1]]
(use-package! tetris
  :bind (:map tetris-mode-map
         ("z" . tetris-rotate-prev)
         ("x" . tetris-rotate-next)
         ("k" . tetris-move-bottom)
         ("h" . tetris-move-left)
         ("j" . tetris-move-down)
         ("l" . tetris-move-right)))
;; Tetris:1 ends here

;; [[file:config.org::*2048][2048:1]]
(use-package! 2048-game
  :bind (:map 2048-mode-map
              ("h" . 2048-left)
              ("j" . 2048-down)
              ("k" . 2048-up)
              ("l" . 2048-right)))
;; 2048:1 ends here

;; [[file:config.org::*ERC][ERC:1]]
  (setq erc-log-channels-directory "~/logs/")
  (setq erc-save-buffer-on-part t)
  (global-set-key (kbd "H-M-e") (lambda () (interactive) (erc :server "irc.freenode.net" :port 6667 :nick "tesrodome" :password passwords_ERC)))
;; ERC:1 ends here

;; [[file:config.org::*Keybinds][Keybinds:1]]
  ;;; replace-regexp
  (global-set-key (kbd "C-M-$") 'replace-regexp)

  ;;; Open .emacs.d
  (global-set-key (kbd "H-C-M-e") (lambda () (interactive) (dired "~/.emacs.d/")))

  ;;; Regular find-file
  (global-set-key (kbd "H-C-x o") (lambda () (interactive) (switch-to-buffer "*Org Agenda*")))


  ;;; Close window
  (global-set-key (kbd "s-0") 'delete-window)
;; Keybinds:1 ends here

;; [[file:config.org::*Keybinds][Keybinds:2]]
  (global-set-key (kbd "<f8>") 'insert-org-image)
;; Keybinds:2 ends here

;; [[file:config.org::*which-key][which-key:1]]
(use-package! which-key
  :config
  (which-key-mode)
  (setq which-key-popup-type 'side-window)
  (setq which-key-side-window-location 'bottom)
  (setq which-key-idle-delay 2.5))
;; which-key:1 ends here

;; [[file:config.org::*Line Moving][Line Moving:1]]
(map! :n "j" 'next-line
      :n "k" 'previous-line)
;; Line Moving:1 ends here

;; [[file:config.org::*Hydra for Resizing Windows][Hydra for Resizing Windows:1]]
  (defhydra hydra-windowmanage (global-map "H-c ^")
    "Hydra for window management."
    ("=" enlarge-window "+Vertical")
    ("-" (enlarge-window -1) "-Vertical")
    ("]" enlarge-window-horizontally "+Horizontal")
    ("[" shrink-window-horizontally "-Horizontal")
    ("q" nil "Quit"))

  (global-set-key (kbd "C-c C-6") 'hydra-windowmanage/body)
;; Hydra for Resizing Windows:1 ends here

;; [[file:config.org::*User Configuration][User Configuration:1]]
(setq user-full-name "Pierce Wang"
      user-mail-address "pierce.g.wang@gmail.com")
;; User Configuration:1 ends here

;; [[file:config.org::*Dired][Dired:1]]
  (setq delete-by-moving-to-trash t)
  (setq trash-directory "~/.Trash")
  (setq insert-directory-program "/usr/local/bin/gls"
        dired-use-ls-dired t)
;; Dired:1 ends here

;; [[file:config.org::*Dired][Dired:2]]
  (setq dired-dwim-target t)
;; Dired:2 ends here

;; [[file:config.org::*Dired][Dired:3]]
  (define-key dired-mode-map (kbd "P") nil)
;; Dired:3 ends here

;; [[file:config.org::*Dired][Dired:4]]
  (define-key dired-mode-map (kbd "O") 'pgw/dired-open-file)
;; Dired:4 ends here

;; [[file:config.org::*Dired][Dired:5]]
  (define-key dired-mode-map (kbd "Y") 'dired-do-symlink)
;; Dired:5 ends here

;; [[file:config.org::*Human readable format for ls switches (=-h=)][Human readable format for ls switches (=-h=):1]]
  (setq dired-listing-switches "-alh")
  (setq dired-actual-switches "-alh")
;; Human readable format for ls switches (=-h=):1 ends here
