personal.el

;; [[file:config.org::*Flyspell mode][Flyspell mode:1]]
  (defun pgw/turn-on-flyspell-hook ()
    (if (or (string-match "^/Users/piercewang/Dropbox/org/notes/college/" (if (eq buffer-file-name nil) "" buffer-file-name)))
        (flyspell-mode 1)))

  (add-hook! 'org-mode-hook 'turn-on-flyspell)
;; Flyspell mode:1 ends here

;; [[file:config.org::*User Configuration][User Configuration:1]]
(setq user-full-name "Pierce Wang"
      user-mail-address "pierce.g.wang@gmail.com")
;; User Configuration:1 ends here
