config.el

;; [[file:config.org::*browse-url-firefox-program][browse-url-firefox-program:1]]
  (setq browse-url-firefox-program "/Applications/Firefox.app/Contents/MacOS/firefox-bin")
;; browse-url-firefox-program:1 ends here
