personal.el

;; [[file:config.org::*Generate Class Calendar][Generate Class Calendar:1]]
(defun pgw/date-block (absolute y1 m1 d1 y2 m2 d2)
  "Block date entry. An adapted version of the `diary-block'
function from the diary-lib."
  (let ((date1 (calendar-absolute-from-gregorian
                (diary-make-date y1 m1 d1)))
        (date2 (calendar-absolute-from-gregorian
                (diary-make-date y2 m2 d2)))
        (d absolute))
    (and (<= date1 d) (<= d date2))))

(defun pgw/date-date (absolute year month day)
  "Check for equality of date"
  (equal absolute (calendar-absolute-from-gregorian (diary-make-date year month day))))

(defun pgw/check-ohs-class (absolute classname semesters days times fallstart fallend springstart springend noclasses)
  "Returns a list with formatted strings: (classname curdate
headline). These can then be used to create the headline. The curdate
is in the form of a list"
  (let* ((dayname (calendar-day-of-week (calendar-gregorian-from-absolute absolute)))
         (curdate (calendar-gregorian-from-absolute absolute))
         (time (nth (- (length days) (length (memq dayname days))) times)))
    (when (and (memq dayname days) ;; Account for MLK Monday on Friday
               (or (if (memq 1 semesters) (pgw/date-block absolute (nth 0 fallstart) (nth 1 fallstart) (nth 2 fallstart)
                                                         (nth 0 fallend) (nth 1 fallend) (nth 2 fallend)))
                   (if (memq 2 semesters) (pgw/date-block absolute (nth 0 springstart) (nth 1 springstart) (nth 2 springstart)
                                                          (nth 0 springend) (nth 1 springend) (nth 2 springend)))))
      (when (not (memq 't
                           (mapcar (lambda (noclass) (if (> (length noclass) 3)
                                                          (pgw/date-block absolute (nth 0 noclass) (nth 1 noclass) (nth 2 noclass) (nth 3 noclass) (nth 4 noclass) (nth 5 noclass))
                                                        (pgw/date-date absolute (nth 0 noclass) (nth 1 noclass) (nth 2 noclass))))
                                noclasses)))
            (list classname curdate time)))))

(defun pgw/create-entry (classname semesters days times &optional desc custom-dates)
  "Creates headlines for class schedule.
CLASSNAME: a string with the class name (to appear on agenda)

SEMESTERS: a list of integers. e.g. for both just a first semester:
'(1) or for both semesters '(1 2)

DAYS: the days of the class. Normally it will be M/W or T/Th but in
order to have flexibility, the function takes an input of another list
of integers representing days of the week. Monday starts on 1 and
Sunday is 0

TIMES: a cons list containing a list of the times which should be
the same length as the list of days

optional DESC: string containing a description for the event

This function uses the variable `pgw/schoolyear-dates' for the value of holidays
unless custom-dates is specified"

  (let* ((current (calendar-absolute-from-gregorian (diary-make-date 2021 9 9)))
         (desc (if desc (setq desc (format "\n%s\n" desc)) (setq desc "")))
         (schoolyear-dates (if custom-dates custom-dates (setq schoolyear-dates pgw/schoolyear-dates)))
         (fallstart (gethash "fallstart" schoolyear-dates))
         (fallend (gethash "fallend" schoolyear-dates))
         (springstart (gethash "springstart" schoolyear-dates))
         (springend (gethash "springend" schoolyear-dates))
         (noclasses (gethash "noclasses" schoolyear-dates)))
    (goto-char (point-max))
    (insert (format "\n* %s" classname))
    (while (pgw/date-block current (nth 0 fallstart) (nth 1 fallstart) (nth 2 fallstart)
                           (nth 0 springend) (nth 1 springend) (nth 2 springend)) ; Make sure we're within starting and ending dates of school
      (let ((info (pgw/check-ohs-class current classname semesters days times fallstart fallend springstart springend noclasses)))
        (when info
          (let* ((headline (nth 0 info))
                 (days-of-week '("Sun" "Mon" "Tue" "Wed" "Thu" "Fri" "Sat"))
                 (fulldate (nth 1 info))
                 (year (nth 2 fulldate))
                 (month (nth 0 fulldate))
                 (day (nth 1 fulldate))
                 (dayofweek (nth (calendar-day-of-week fulldate) days-of-week))
                 (time (nth 2 info)))
            (goto-char (point-max))
            ;; (insert (format "\n** %s\n:PROPERTIES:\n:TIMEZONE: UTC\n:END:\n<%d-%02d-%02d %s %s>\n%s"
            ;;                 headline year month day dayofweek time desc)))))
            (insert (format "\n** %s\n<%d-%02d-%02d %s %s>\n%s"
                            headline year month day dayofweek time desc)))))
      (setq current (+ current 1)))))

;; (setq pgw/schoolyear-dates
;;       #s(hash-table
;;          size 5
;;          test equal
;;          data ("fallstart" (2021 9 9)
;;                "fallend" (2021 12 13)
;;                "springstart" (2022 1 18)
;;                "springend" (2022 5 2)
;;                "noclasses" ((2021 9 6) ;; Labor Day
;;                             (2021 11 1) ;; No Classes
;;                             (2021 11 2) ;; Election Day, University Holiday
;;                             (2021 11 24 2021 11 26) ;; No Classes
;;                             (2021 11 25) ;; Thanksgiving, University Holiday
;;                             (2022 1 17)            ;; Martin Luther King Jr. Day, University Holiday
;;                             (2022 3 14 2022 3 18))  ;; Spring Break
;;                             )))

(setq pgw/schoolyear-dates
      #s(hash-table
         size 5
         test equal
         data ("fallstart" (2021 08 30)
               "fallend" (2021 12 17)
               "springstart" (2022 1 18)
               "springend" (2022 5 13)
               "noclasses" ((2021 9 6) ;; Labor Day
                            (2021 11 1) ;; No Classes
                            (2021 11 2) ;; Election Day, University Holiday
                            (2021 11 24 2021 11 26) ;; No Classes
                            (2021 11 25) ;; Thanksgiving, University Holiday
                            (2022 1 17)  ;; Martin Luther King Jr. Day, University Holiday
                            (2022 3 14 2022 3 18)  ;; Spring Break
                            (2022 5 3 2022 5 13)) ; Reading and Exam Days
                            )))

(setq pgw/juilliard-schoolyear-dates
      #s(hash-table
         size 5
         test equal
         data ("fallstart" (2021 08 30)
               "fallend" (2021 12 17)
               "springstart" (2022 1 10)
               "springend" (2022 5 13)
               "noclasses" ((2021 9 6) ;; Labor Day
                            (2021 11 1) ;; No Classes
                            (2021 11 2) ;; Election Day, University Holiday
                            (2021 11 24 2021 11 28) ;; No Classes
                            (2021 11 25) ;; Thanksgiving, University Holiday
                            (2022 1 17)  ;; Martin Luther King Jr. Day, University Holiday
                            (2022 2 26 2022 3 13)) ;; Midterm Recess
                            ;; (2022 5 3 2022 5 6)) ;; Jury week
                            )))
;; Generate Class Calendar:1 ends here
