config.org
*** Sync gcal Bash Script

This runs a bash script which in turn
1. curls the calendar file from the Canvas website
2. runs a python program which parses the calendar file into =ohs_gcal.org= according to the class. In doing so, it takes into account whether the timestamp should be a deadline or not.

See [[https://github.com/piercegwang/ohsics_to_org][https://github.com/piercegwang/ohsics_to_org]] for more info.
#+begin_src emacs-lisp :results silent
(defun pgw/sync-canvas-cal ()
  (interactive)
  (start-process-shell-command "Running syncgcal.sh" nil "bash ~/Documents/github/org_canvas_parser/syncgcal.sh"))

(map! :leader "d o" #'pgw/sync-canvas-cal)
#+end_src

** ~vterm~

#+begin_src emacs-lisp
(after! vterm
  (add-hook! vterm-mode
             (evil-emacs-state 1))
  (add-to-list 'vterm-tramp-shells '("sshx" "/bin/bash"))
  (setq vterm-shell "zsh"))
#+end_src

** Languages

*** Python

#+begin_src emacs-lisp
(add-hook! python-mode
             (add-to-list 'python-shell-completion-native-disabled-interpreters "python3"))

#+end_src

#+begin_src emacs-lisp :tangle no
(use-package! lsp-pyright
  :ensure t
  :hook (python-mode . (lambda ()
                          (require 'lsp-pyright)
                          (lsp))))  ; or lsp-deferred
#+end_src

** Mu MUD Client

#+begin_src emacs-lisp :tangle no
(use-package! mu
  :config
  (autoload 'mu-open "mu" "Play on MUSHes and MUDs" t)
  (add-hook 'mu-connection-mode-hook 'ansi-color-for-comint-mode-on)
  (add-hook 'mu-input-mode-hook (lambda ()
                                  (electric-pair-mode 0)))
  (map! :leader "o m" 'mu-open))
#+end_src

** nov - for reading epub

#+begin_src emacs-lisp
(add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))

;; (defun my-nov-font-setup ()
;;   (face-remap-add-relative 'variable-pitch :family "Avenir Next"
;;                                            :height 1.0))
;; (add-hook 'nov-mode-hook 'my-nov-font-setup)
#+end_src

** Passwords :crypt:


-----BEGIN PGP MESSAGE-----

hQGMAw/LnjL7EsekAQv/eAC0GniXNNVp7j9sXGyZulV9ErmvF5eWUbVZ8ZLWGsM9
vT5rLyOALn4Y7e9W/KHKD6qmInz6Dad9RqW1Q0s0pLpxJoZhn0sCwD7GlPSTAW7w
WafQEtgYCCFrcEtgwALRVxr7OW7IYqmg7On8+aHsUq2v56he4BmVBR2f7Rl3Wh80
BpZakkQa1halA1s9hPKE4hSs1o/Bvpt0K2NP5rQj2ffZrusUS7b4j98dKt73ndoj
S/yWaDix6F+P02Xum7tObsvptpMCTm6Dlx9me9uaAY8O/LjAxfMNoTEoWjoj45gr
kkHGxEiBDHl6Cv2HVJKjrHsZmoqiY3jKtPeibLnveePGyKTDgVseKFiAhrtsWzAs
EIkF2/r4y3dptO0lD6NymXHY/06ozAuxF4mLEQx1UrlSFlQt+YrRnkMBABZ8eixj
CxPn8hnHk8dk1lh0lQ2zxU/+vqh9smkwXO0cpDBSVMNdmkXzy+91LCXL7nkBUTbg
KGNmYzm9eIVKF44jsb+m0uoBlRflxnbl5/1ULr4Eyd/u+E9Chi9EQIHbpd0ESg/E
v7b9YzP3Mpt3lkBpKe8amidQii2A31IbH+CVeggkNhKf/5W8B0gEvaxe1OCtxQrr
DfgDo63lnkKUVUPudgy3Go0LSP8aaxuSJexDLmYYYdZqA3YqbMjkKh50yQgya0kq
PU5eyYuVN2cZoEX33lwCCQNt+LCQXzhjUvuubcm9gmfpXfl26FlUzKdXVw8igaVR
0jwZ6meBcB0Lj7gJLencHeLEm3qwm5Uoz9Ap4j32nRcgVn+SA+quCJ2Ai5H1X0/c
7Uz5vwaIXve/7n2LQ7DKBn4MZcXxgTcdx5iZr00PLqFXrm2FINIqucNfRhr08TBG
yB/1DSPKPsIRJs7/Q35pRGmXFltbZyLFbrDPGNe0VswDaT6eOf3a67+yF+bzqujk
gso9+U/o0c36EtckqEZh64ZwnZU+0MpQ6gGL+l5IOg2H45cbHj0Wt6Q7KfYRsl5G
RJqdB2NcOenpC4QdwhjG9TFNzagj7YrmNa5S4JbtGOIdK2ajJHhqQX0HlGIVPAIj
bzvUvfdh3qWRUYQJj6ZIcPdhOtexc/Hv6WLLsgVQDNwliHw+RZyj1rV3fRcl13Y+
hB+BZRQrKqJap1y1b7P2Krkkjp+euSwcg+e314b/ReuWaObGc7z7iHt3dG4Vf6cW
Tb7MpuaWh3ferhYwOLFqS+P3nekQ3+GInZTU3c7dXsn9yxBoqU5I7DLNP6DCf6cj
HapGJbLtlAawzYyh+gRzSQXOD5onab9JuhVLtsOUeYhPByjpRpcHEqGGf4BFa6Mg
WbxT/b2omZ/W7T85DpYBXVW+fMYiTf5BFvZx2viq+YvkESJECPb6adBTV/BNMOk1
fcvfmLoymPfQiIUPZyl3RBSoo4hRshvmja4gyBA9VuGFIF7JMPaXymlNOHrn+Uuq
j4pBlcGKx2Gp+EvdKoMzGCWm6B6wzMm+eF60Sq8p7DXw5UdMfBpDgiKmhVtMf0hF
xw47SHgZucoofGS7Sj2PPoJYJAOoeVbcRHgtSICaJe0Wk/xl3x1G44sr3KJEBW/U
3veX6Hg+kdjcBCUQB3Rdnv0rOZ1Nh0j6ve+fpBlDZfMvwa6Cysx+Znr1Ql4EO7l5
fbLXe5IgwKWxsFMijpfN1VXhxhJalW1S2/By3YQq/8QsSoKIHoS1Qh9CFoskZCBR
aUcKSsUvPVsSsaDHO1L+iPoGykhVMtW44ExvJMLzM8dlnn2VhN1CTeLeiVKe2kA3
13h05yeWKuwhOphmFKnrpAThPk/w0+1EItOvwxymuMWyRIJTU6HDGgZ+ZwTp0Dnn
xCyb+yyb06uzVkFszlbm3lS/Quq0YdY5iNqdRQ+aoIVoI7BAoOj9N/K4ThC44KIP
ONQJauRrq4EZw4+O5x+3jB6GHXSO
=N1Pd
-----END PGP MESSAGE-----

* Doom Modules
:PROPERTIES:
:header-args:emacs-lisp: :tangle no :comments no
:END:

All configurations here get "tangled" into the ~init.el~ file, telling Doom Emacs which modules I want to load.

#+begin_src emacs-lisp :tangle "init.el" :noweb no-export :results silent
;;; init.el -*- lexical-binding: t; -*-

;; This file controls what Doom modules are enabled and what order they load
;; in. Remember to run 'doom sync' after modifying it!

;; NOTE Press 'SPC h d h' (or 'C-h d h' for non-vim users) to access Doom's
;;      documentation. There you'll find a "Module Index" link where you'll find
;;      a comprehensive list of Doom's modules and what flags they support.

;; NOTE Move your cursor over a module's name (or its flags) and press 'K' (or
;;      'C-c c k' for non-vim users) to view its documentation. This works on
;;      flags as well (those symbols that start with a plus).
;;
;;      Alternatively, press 'gd' (or 'C-c c d') on a module to browse its
;;      directory (for easy access to its source code).

(doom! :input
       <<doom-input>>

       :completion
       <<doom-completion>>

       :ui
       <<doom-ui>>

       :editor
       <<doom-editor>>

       :emacs
       <<doom-emacs>>

       :term
       <<doom-term>>

       :checkers
       <<doom-checkers>>

       :tools
       <<doom-tools>>

       :os
       <<doom-os>>

       :lang
       <<doom-lang>>

       :email
       <<doom-email>>

       :app
       <<doom-app>>

       :config
       <<doom-config>>
       )
#+end_src

#+name: doom-input
#+begin_src emacs-lisp
;;chinese
;;japanese
;;layout            ; auie,ctsrnm is the superior home row
#+end_src

#+name: doom-completion
#+begin_src emacs-lisp
company           ; the ultimate code completion backend
;;helm              ; the *other* search engine for love and life
;;ido               ; the other *other* search engine...
ivy               ; a search engine for love and life
#+end_src

#+name: doom-ui
#+begin_src emacs-lisp
;;deft              ; notational velocity for Emacs
doom              ; what makes DOOM look the way it does
doom-dashboard    ; a nifty splash screen for Emacs
doom-quit         ; DOOM quit-message prompts when you quit Emacs
(emoji +unicode)  ; 🙂
hl-todo           ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
;;hydra
;;indent-guides     ; highlighted indent columns
ligatures         ; ligatures and symbols to make your code pretty again
;;minimap           ; show a map of the code on the side
modeline          ; snazzy, Atom-inspired modeline, plus API
;;nav-flash         ; blink cursor line after big motions
;;neotree           ; a project drawer, like NERDTree for vim
ophints           ; highlight the region an operation acts on
(popup +defaults)   ; tame sudden yet inevitable temporary windows
;;tabs              ; a tab bar for Emacs
;;treemacs          ; a project drawer, like neotree but cooler
unicode           ; extended unicode support for various languages
vc-gutter         ; vcs diff in the fringe
vi-tilde-fringe   ; fringe tildes to mark beyond EOB
;;window-select     ; visually switch windows
workspaces        ; tab emulation, persistence & separate workspaces
zen               ; distraction-free coding or writing
#+end_src

#+name: doom-editor
#+begin_src emacs-lisp
(evil +everywhere); come to the dark side, we have cookies
file-templates    ; auto-snippets for empty files
fold              ; (nigh) universal code folding
;;(format +onsave)  ; automated prettiness
;;god               ; run Emacs commands without modifier keys
;;lispy             ; vim for lisp, for people who don't like vim
;;multiple-cursors  ; editing in many places at once
;;objed             ; text object editing for the innocent
;;parinfer          ; turn lisp into python, sort of
;;rotate-text       ; cycle region at point between text candidates
snippets          ; my elves. They type so I don't have to
;;word-wrap         ; soft wrapping with language-aware indent
#+end_src

#+name: doom-emacs
#+begin_src emacs-lisp
dired             ; making dired pretty [functional]
electric          ; smarter, keyword-based electric-indent
;; ibuffer         ; interactive buffer management
undo              ; persistent, smarter undo for your inevitable mistakes
vc                ; version-control and Emacs, sitting in a tree
#+end_src

#+name: doom-term
#+begin_src emacs-lisp
eshell            ; the elisp shell that works everywhere
;;shell             ; simple shell REPL for Emacs
;;term              ; basic terminal emulator for Emacs
vterm             ; the best terminal emulation in Emacs
#+end_src

#+name: doom-checkers
#+begin_src emacs-lisp
syntax              ; tasing you for every semicolon you forget
(spell +flyspell) ; tasing you for misspelling mispelling
grammar           ; tasing grammar mistake every you make
#+end_src

#+name: doom-tools
#+begin_src emacs-lisp
;;ansible
;;debugger          ; FIXME stepping through code, to help you add bugs
;;direnv
;;docker
;;editorconfig      ; let someone else argue about tabs vs spaces
;;ein               ; tame Jupyter notebooks with emacs
(eval +overlay)     ; run code, run (also, repls)
;;gist              ; interacting with github gists
;; lookup              ; navigate your code and its documentation
lsp               ; M-x vscode
magit             ; a git porcelain for Emacs
;;make              ; run make tasks from Emacs
;;pass              ; password manager for nerds
pdf               ; pdf enhancements
;;prodigy           ; FIXME managing external services & code builders
;;rgb               ; creating color strings
;;taskrunner        ; taskrunner for all your projects
;;terraform         ; infrastructure as code
;;tmux              ; an API for interacting with tmux
;;upload            ; map local to remote projects via ssh/ftp
#+end_src

#+name: doom-os
#+begin_src emacs-lisp
(:if IS-MAC macos)  ; improve compatibility with macOS
;;tty               ; improve the terminal Emacs experience
#+end_src

#+name: doom-lang
#+begin_src emacs-lisp
;;agda              ; types of types of types of types...
;;beancount         ; mind the GAAP
cc                ; C > C++ == 1
;;clojure           ; java with a lisp
;;common-lisp       ; if you've seen one lisp, you've seen them all
;;coq               ; proofs-as-programs
;;crystal           ; ruby at the speed of c
;;csharp            ; unity, .NET, and mono shenanigans
;;data              ; config/data formats
;;(dart +flutter)   ; paint ui and not much else
;;elixir            ; erlang done right
;;elm               ; care for a cup of TEA?
emacs-lisp        ; drown in parentheses
;;erlang            ; an elegant language for a more civilized age
;;ess               ; emacs speaks statistics
;;factor
;;faust             ; dsp, but you get to keep your soul
;;fsharp            ; ML stands for Microsoft's Language
;;fstar             ; (dependent) types and (monadic) effects and Z3
;;gdscript          ; the language you waited for
;;(go +lsp)         ; the hipster dialect
;;(haskell +dante)  ; a language that's lazier than I am
;;hy                ; readability of scheme w/ speed of python
;;idris             ; a language you can depend on
;;json              ; At least it ain't XML
;;(java +meghanada) ; the poster child for carpal tunnel syndrome
javascript        ; all(hope(abandon(ye(who(enter(here))))))
;;julia             ; a better, faster MATLAB
;;kotlin            ; a better, slicker Java(Script)
(latex             ; writing papers in Emacs has never been so fun
 +cdlatex)
;;lean              ; for folks with too much to prove
;;ledger            ; be audit you can be
lua               ; one-based indices? one-based indices
markdown          ; writing docs for people to ignore
;;nim               ; python + lisp at the speed of c
;;nix               ; I hereby declare "nix geht mehr!"
;;ocaml             ; an objective camel
(org +roam)       ; organize your plain life in plain text
;;php               ; perl's insecure younger brother
;;plantuml          ; diagrams for confusing people more
;;purescript        ; javascript, but functional
(python +lsp)            ; beautiful is better than ugly
;;qt                ; the 'cutest' gui framework ever
;;racket            ; a DSL for DSLs
;;raku              ; the artist formerly known as perl6
;;rest              ; Emacs as a REST client
;;rst               ; ReST in peace
;;(ruby +rails)     ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
;;rust              ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
;;scala             ; java, but good
;;(scheme +guile)   ; a fully conniving family of lisps
sh                ; she sells {ba,z,fi}sh shells on the C xor
;;sml
;;solidity          ; do you need a blockchain? No.
;;swift             ; who asked for emoji variables?
;;terra             ; Earth and Moon in alignment for performance.
;;web               ; the tubes
;;yaml              ; JSON, but readable
;;zig               ; C, but simpler
#+end_src

#+name: doom-email
#+begin_src emacs-lisp
;;(mu4e +gmail)
;;notmuch
;;(wanderlust +gmail)
#+end_src

#+name: doom-app
#+begin_src emacs-lisp
calendar
;;emms
;;everywhere        ; *leave* Emacs!? You must be joking
;;irc               ; how neckbeards socialize
;;(rss +org)        ; emacs as an RSS reader
;;twitter           ; twitter client https://twitter.com/vnought
#+end_src

#+name: doom-config
#+begin_src emacs-lisp
literate
(default +bindings +smartparens)
#+end_src

