personal.el

;; [[file:config.org::*Sync gcal Bash Script][Sync gcal Bash Script:1]]
(defun pgw/sync-canvas-cal ()
  (interactive)
  (start-process-shell-command "Running syncgcal.sh" nil "bash ~/Documents/github/org_canvas_parser/syncgcal.sh"))

(map! :leader "d o" #'pgw/sync-canvas-cal)
;; Sync gcal Bash Script:1 ends here

;; [[file:config.org::*End of personal.el][End of personal.el:1]]
(provide '.personal)
;; End of personal.el:1 ends here
